{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering Science",
      "department": "Software Engineering",
      "duration": "2018-2023",
      "school_name": "University of Western Ontario"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AmitVerma.git",
  "highlighted_projects": [
    {
      "description": "Led the conception and execution of the Western Engineering Student Management Application. Orchestrated the development of a robust RESTful API using Express.js, TypeScript, and Node.js, creating 30+ endpoints. Designed and implemented the React.js front-end with React hooks and Redux, stylized with Tailwind CSS. Established a PostgreSQL relational database. Guided a dynamic software engineering team in delivering a production-ready Student Management System for Western Engineering's Wood and Metal Workshops.",
      "git_url": null,
      "name": "Western Engineering Student Management Application"
    },
    {
      "description": "Developed a Machine Learning NBA MVP Predictor employing Python, Numpy, Pandas, Scikit-Learn, and Google Colab. Trained three models - Random Forest, Adaboost, and SVM regressors - utilizing Scikit-learn for model training and testing. Conducted preprocessing of NBA player statistical datasets dating back to 1982, strategically selecting impactful features using Numpy and Pandas. Achieved accurate predictions of the top three MVP candidates, with all models consistently aligning with professional predictors.",
      "git_url": null,
      "name": "Machine Learning NBA MVP Predictor"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed Bash scripts on CentOS to pull system information and usage and save to a PostgreSQL database running in a docker container. Utilized crontab to create an automated process and git for version control.",
      "git_url": "https://github.com/jarviscanada/jarvis_data_eng_AmitVerma/tree/master/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    }
  ],
  "name": "Amit Verma",
  "others": [
    {
      "bullets": [
        "AWS Certified Cloud Practitioner (2023)"
      ],
      "title": "Certifications"
    },
    {
      "bullets": [
        "Sports",
        "Gaming",
        "Hiking/Nature"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented software solutions leveraging a variety of tools such as Linux/Bash, Docker, Git, etc",
      "duration": "Nov 2023 - present",
      "title": "Software Developer"
    },
    {
      "company": "Geotab Inc",
      "description": "Implemented full-stack solutions, enhancing efficiency using TypeScript, HTML, CSS, and .NET Framework. Led the creation of 50+ features, amplifying user engagement by 20%. Investigated and resolved bugs, cutting Raygun errors by 24%. Improved Canadian ELD timing logic, reducing compliance issues. Developed robust unit test suites and ensured WCAG 2.0 standards for Section 508 compliance, securing government contracts and expanding the user base.",
      "duration": "May 2021 - Aug 2022",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "Java",
      ".NET/C#",
      "Linux/Bash",
      "Angular"
    ],
    "familiar": [
      "AWS",
      "Unity",
      "Jira",
      "Webpack",
      "Machine Learning"
    ],
    "proficient": [
      "JavaScript",
      "React",
      "Express",
      "RDBMS/SQL",
      "NoSQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "Hi! I'm Amit Verma, a results-driven Software Engineer based in Toronto, Canada. With a Bachelor's degree in Software Engineering from the University of Western Ontario, I bring a solid academic foundation and hands-on experience in front-end technologies like JavaScript, TypeScript, React, and back-end technologies such as Node.js, .NET Core, and PostgreSQL. As a Software Developer at Geotab Inc, I enhanced operating efficiency and user engagement by implementing full-stack solutions and spearheading the design of 50+ features. In pursuit of a Software Developer role, I am eager to contribute my technical skills, collaborative mindset, and innovative problem-solving abilities. I am confident that my blend of technical acumen and dedication makes me an ideal candidate for driving success in software development endeavors."
}
